data_generation/simulation_results/openfoam/case_61/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


4
(
    empty
    {
        type            empty;
        physicalType    patch;
        nFaces          20550;
        startFace       20300;
    }

    walls
    {
        type            wall;
        physicalType    patch;
        nFaces          392;
        startFace       40850;
    }

    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       41242;
    }

    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       41292;
    }

)


// ************************************************************************* //
