data_generation/simulation_results/openfoam/case_61/constant/simParams
nIter 2000;
hComponent0 1047.3209912872026;
hComponent1 527.6979321318142;
hComponent2 1143.643370710408;
hComponent3 1497.544929040249;
hComponent4 1163.3468803911946;kComponent0 82.02698433969628;
kComponent1 90.02241993695299;
kComponent2 21.88169111614242;
kComponent3 28.529951484699676;
kComponent4 21.77223244984455;
tAmbient 300;
Ux 1.4758681739946677;
kPCB 0.11986922306278548;